
## Plan Result

[CI link](https://github.com/HitokiYamamoto/Terraform/actions/runs/22008531243)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.github_repository.module.nextjs_tutorial.github_repository.main
* Delete
  * module.github_repository.module.budget_book.github_repository.main


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.github_repository.module.budget_book.github_repository.main will be destroyed
  # (because github_repository.main is not in configuration)
  - resource "github_repository" "main" {
      - allow_auto_merge                        = false -> null
      - allow_forking                           = true -> null
      - allow_merge_commit                      = true -> null
      - allow_rebase_merge                      = true -> null
      - allow_squash_merge                      = true -> null
      - allow_update_branch                     = false -> null
      - archived                                = false -> null
      - auto_init                               = true -> null
      - default_branch                          = "main" -> null
      - delete_branch_on_merge                  = true -> null
      - description                             = "家計簿管理用リポジトリ" -> null
      - etag                                    = "W/\"756bc08b17ba679bdeb5622bbbf6e201444a6e3c28cb394a9af7c810a2011592\"" -> null
      - fork                                    = "false" -> null
      - full_name                               = "HitokiYamamoto/Budget-Book" -> null
      - git_clone_url                           = "git://github.com/HitokiYamamoto/Budget-Book.git" -> null
      - has_discussions                         = false -> null
      - has_downloads                           = false -> null
      - has_issues                              = false -> null
      - has_projects                            = false -> null
      - has_wiki                                = false -> null
      - html_url                                = "https://github.com/HitokiYamamoto/Budget-Book" -> null
      - http_clone_url                          = "https://github.com/HitokiYamamoto/Budget-Book.git" -> null
      - id                                      = "Budget-Book" -> null
      - ignore_vulnerability_alerts_during_read = false -> null
      - is_template                             = false -> null
      - merge_commit_message                    = "PR_TITLE" -> null
      - merge_commit_title                      = "MERGE_MESSAGE" -> null
      - name                                    = "Budget-Book" -> null
      - node_id                                 = "R_kgDORKgJtw" -> null
      - primary_language                        = "CSS" -> null
      - private                                 = true -> null
      - repo_id                                 = 1151863223 -> null
      - squash_merge_commit_message             = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title               = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url                           = "git@github.com:HitokiYamamoto/Budget-Book.git" -> null
      - svn_url                                 = "https://github.com/HitokiYamamoto/Budget-Book" -> null
      - topics                                  = [
          - "budget",
          - "react",
          - "typescript",
        ] -> null
      - visibility                              = "private" -> null
      - vulnerability_alerts                    = true -> null
      - web_commit_signoff_required             = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.github_repository.module.nextjs_tutorial.github_repository.main will be created
  + resource "github_repository" "main" {
      + allow_auto_merge                        = false
      + allow_forking                           = false
      + allow_merge_commit                      = true
      + allow_rebase_merge                      = true
      + allow_squash_merge                      = true
      + archived                                = false
      + auto_init                               = true
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = true
      + description                             = "Nest.js"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_issues                              = false
      + has_wiki                                = false
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "Nextjs-Tutorial"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "nextjs",
          + "tutorial",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":201,"Program":"tfcmt","SHA1":"38f1ebbd784e056d3fb945a8972a497f55b8de05","Vars":{},"WorkflowName":"Terraform"} -->